import random
import os
import time
def show_logo():
    print("""разработчики:
██╗░░██╗███████╗████████╗░░░░░░░░░██╗░░██╗░█████╗░████████╗
██║░██╔╝██╔════╝╚══██╔══╝░░░░░░░░░██║░██╔╝██╔══██╗╚══██╔══╝
█████╔╝░█████╗░░░░░██║░░░░░░░░░░░░█████╔╝░███████║░░░██║░░░
██╔═██╗░██╔══╝░░░░░██║░░░░░░░░░░░░██╔═██╗░██╔══██║░░░██║░░░
██║░░██╗███████╗░░░██║░░░███████╗░██║░░██╗██║░░██║░░░██║░░░
╚═╝░░╚═╝╚══════╝░░░╚═╝░░░╚══════╝░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░
""")

def clear_screen_with_logo():
    os.system("cls")  
    show_logo()



show_logo() 

while True:
    print("\rЗапуск программы...", end="")
    time.sleep(0.3)
    
    print("\rЗапуск программы.. ", end="") 
    time.sleep(0.5)
    
    print("\rЗапуск программы.  ", end="")
    time.sleep(1)
    
    print("\rКонец запуска программы")
    time.sleep(0.5)
    
    clear_screen_with_logo()
    break

def player():
    attempts = 0

    print("""
выберите уровень сложности:
1.легко : от 1 до 10
2.среднее: от 1 до 100
3.сложно: от 1 до 500
4.невозможно: от 1 до 1000
""")

    
    while True:
        try:
            input_plaer_meny = int(input("///  "))
        except ValueError:
            print("Вводите цифрами")
            continue
        if input_plaer_meny == 1:
            number = random.randint(1,10)
        elif input_plaer_meny == 2:
            number = random.randint(1,100)
        elif input_plaer_meny == 3:
            number = random.randint(1,500)
        elif input_plaer_meny == 4:
            number = random.randint(1,1000)
        else:
            print("число вне диапозона надо от 1, 4")
            continue
        break
            
    while True:
        print("сколько хотите себе попыток? 0 = 6")
        
        try:
            i = int(input("///  "))
        except ValueError:
            print("Вводите цифрами")
            continue
        
        if i == 0:
            i += 6
        break 

    while True:
        try:
            input_plaer = int(input('введи число:'))
        except:
            print("вводите числами")
            continue
        attempts += 1
        if number <  input_plaer:
            print('меньше')
        elif number > input_plaer:
            print('больше')
        else:
            print(f'Ты угадал за {attempts} попыток!')
            break
        if attempts == i:
            print('YOU LOSE')
            break

def computer():
    min = 1
    while True:
        try:
            max = int(input("хорошо какой у вас максимальный диапозон числа? \n///  "))
            break
        except ValueError:
            print("Вводите числами")


    while True:
        try:
            max_attempts = int(input("сколько попыток дадите 0 = 6 \n///  "))
            break
        except ValueError:
            print("Вводите числами")
            
    attempts_min = 0
    if max_attempts == 0:
        max_attempts = 6
    
    while min <= max:
        
        ai_guess = (min + max) // 2
        attempts_min += 1
        player_input = input(f"это {ai_guess}? Моя попытка {attempts_min} из {max_attempts} \n/// ").lower().strip()
        
        if player_input == "угадал":
            print("\nХА ХА ХА у меня памяти... 16 мегабайт! Я победил!")
            break
        elif player_input == "меньше":
            max = ai_guess - 1
        elif player_input == "больше":
            min = ai_guess + 1
            
        else:
            print("Я знаю только команды: больше, меньше, угадал")
            attempts_min -= 1
            
        if min > max:
            print("\nТы путаешься в показаниях! Твое число не может быть одновременно больше и меньше.")
            break

        if attempts_min == max_attempts:
            print("\nОбидно мне... Проиграл...")
            print("""
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@%%#####%%@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@%*=-::::::::::--=*%@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@*=-:::::::::::::::::--=+#@@@@@@@@@@@@@@
@@@@@@@@@@@@#+-::::::=+*+=-::::-=#*=::=*%@@@@@@@@@@@@
@@@@@@@@@@@*-::::::::::-+#%#*--+%+--:::--*%@@@@@@@@@@
@@@@@@@@%+-:-:::::::-::::-=#=-=-:::::::--+%@@@@@@@@@@
@@@@@@@@*-:::::--+*#*+-::::::::--:::-===-:-#@@@@@@@@@
@@@@@@@%=-:::-=+==--=+#+-:-=--=#%%%%@@@=-:-=#@@@@@@@@
@@@@@@@%=::-=+-::::::-+%==*@=::-#@@@@%=--:::+%@@@@@@@
@@@@@@@%-:-=-::::::::-+%@@@%=--::-=+=--:::::-*@@@@@@@
@@@@@@@#-::::::--::-:=#@@@*=::---:::::::---::+@@@@@@@
@@@@@@@%=-:::::---:--+#+=--:=++#%%%%%%%#*+=+=+@@@@@@@
@@@@@@@@+---::-:::--**=:--=#%#++====--:-==*%*#@@@@@@@
@@@@@@@@*-::--:::--++=--=*#+---=====-----====*@@@@@@@
@@@@@@@@#=-------=++--=++=----=---:::-------+#@@@@@@@
@@@@@@@@@*=----=+=--=*%#+=----------=-----=+#@@@@@@@@
@@@@@@@@@%*----==---==+==---------=---=--=--=+*#@@@@@
@@@@@@@@@@@@*+=----==----=----=====--====-=+*#*%@@@@@
@@@@@@@@@@@@@%*+====================-===+*#**#@@@@@@@
@@@@@@@@@@@@@@@@#*+================+**#%@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@%+=======++++**#####%@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@#*+++==*@@%*++*%@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@%###%@@@@%#%@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
""")
            break

while True:
    hi = input("привет! это игра угадай число кто будет угадовать? (я, ты) \n///  ")
    if hi == "я":
        player()
    if hi == "ты":
        computer()
    else:
        print("что?")